music_app/my_music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "sfdh"], ["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = self.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "KDP56jcIQIwsfMRNgDzfvg"], ["updated_at", "2019-09-05 18:39:35.574244"], ["id", 3]]
---
  def reset_session_token
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!